Repository: Hamidulloh02/Greencity
Catalog: locale/*/LC_MESSAGES/django.po
Languages: uz

source: Menu
uz: Bosh sahifa

source: Shop
uz: Maxsulotlar

source: About
uz: Biz haqimizda

source: Contact
uz: Aloqa

source: Free Shipping
uz: Bepul yetkazib berish

source: For orders from $50
uz: $50 dan boshlab buyurtmalar uchun

source: Support 24/7
uz: 24/7 qo‘llab-quvvatlash

source: Call us anytime
uz: Bizga istalgan vaqtda qo‘ng‘iroq qiling

source: 100%% Safety
uz: 100%% xavfsizlik

source: Only secure payments
uz: Faqat xavfsiz to‘lovlar

source: Hot Offers
uz: Qizg‘in takliflar

source: Discounts up to 90%%
uz: 90%% gacha chegirmalar

source: Featured Products
uz: Tavsiya etiladi

source: All
uz: Hammasi

source: New
uz: Yangi

source: Bestsellers
uz: Yangi tovarlar

source: Popular Categories
uz: Ommabop toifalar

source: Top Rated Products
uz: Tavsiya etiladi

source: Special Offers
uz: Chegirma

source: Bestsellers
uz: Tasodifiy

source: Customer Service
uz: Mijozlarga xizmat

source: Description
uz: Tavsif

source: Specification
uz: Texnik parametrlari

source: Reviews
uz: Fikrlar

source: Related Product
uz: Tavsiya etiladi

source: Main Page
uz: Bosh sahifa

source: Welcome to our store!
uz: Bizning do'konimizga xush kelibsiz
